esehehelp/key/hardware/key/ch32x035f7p6/cores/arduino/ch32x_cdc.c
/*
 * ch32x_cdc.c — USB CDC-ACM library for CH32X035.
 * SPDX-License-Identifier: MIT
 *
 * Single-file implementation: descriptors, ISR, ring buffer, TX, API.
 * Endpoints: EP0 control, EP1 IN interrupt (CDC notify), EP2 OUT bulk (RX),
 *            EP3 IN bulk (TX).
 */

#include "ch32x_regs.h"
#include "ch32x_cdc.h"
#include <string.h>

/* ── Constants ───────────────────────────────────────────────── */
#define EP0_SIZE    64
#define EP_SIZE     64

/* USB standard request codes */
#define USB_GET_STATUS          0x00
#define USB_CLEAR_FEATURE       0x01
#define USB_SET_FEATURE         0x03
#define USB_SET_ADDRESS         0x05
#define USB_GET_DESCRIPTOR      0x06
#define USB_GET_CONFIGURATION   0x08
#define USB_SET_CONFIGURATION   0x09
#define USB_GET_INTERFACE       0x0A
#define USB_SET_INTERFACE       0x0B

/* USB descriptor types */
#define USB_DESCR_TYP_DEVICE    0x01
#define USB_DESCR_TYP_CONFIG    0x02
#define USB_DESCR_TYP_STRING    0x03

/* USB request type masks */
#define USB_REQ_TYP_MASK        0x60
#define USB_REQ_TYP_STANDARD    0x00
#define USB_REQ_TYP_CLASS       0x20
#define USB_REQ_RECIP_MASK      0x1F
#define USB_REQ_RECIP_DEVICE    0x00
#define USB_REQ_RECIP_ENDP      0x02
#define USB_REQ_FEAT_ENDP_HALT  0x00

/* CDC class requests */
#define CDC_SET_LINE_CODING     0x20
#define CDC_GET_LINE_CODING     0x21
#define CDC_SET_LINE_CTLSTE     0x22
#define CDC_SEND_BREAK          0x23

/* Endpoint direction */
#define UEP_IN   0x80
#define UEP_OUT  0x00

/* ── USB Setup Packet ────────────────────────────────────────── */
typedef struct __attribute__((packed)) {
    uint8_t  bRequestType;
    uint8_t  bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
} USB_SETUP_REQ;

/* EP5 is the HID keyboard IN endpoint. CH32X035's EP5 registers are at
 * USBFS + 0x54 (DMA), +0x64 (TX length), +0x66 (control high). */
#define HID_DMA      (*(volatile uint32_t *)(USBFS_BASE + 0x54u))
#define HID_TX_LEN   (*(volatile uint16_t *)(USBFS_BASE + 0x64u))
#define HID_CTRL     (*(volatile uint16_t *)(USBFS_BASE + 0x66u))
#define HID_EP5_TX_EN 0x01u

/* Boot keyboard: modifiers, reserved, six simultaneous key usages. */
static const uint8_t hid_report_descr[] = {
    0x05,0x01, 0x09,0x06, 0xA1,0x01, 0x05,0x07,
    0x19,0xE0, 0x29,0xE7, 0x15,0x00, 0x25,0x01,
    0x75,0x01, 0x95,0x08, 0x81,0x02,
    0x95,0x01, 0x75,0x08, 0x81,0x01,
    0x95,0x05, 0x75,0x01, 0x05,0x08,
    0x19,0x01, 0x29,0x05, 0x91,0x02,
    0x95,0x01, 0x75,0x03, 0x91,0x01,
    0x95,0x06, 0x75,0x08, 0x15,0x00,
    0x25,0x65, 0x05,0x07, 0x19,0x00, 0x29,0x65,
    0x81,0x00, 0xC0
};
static const uint8_t empty_report[8] = {0};
static const uint8_t hid_descr[] = {
    0x09,0x21, 0x11,0x01, 0x00, 0x01,0x22,
    sizeof(hid_report_descr),0x00
};

/* ── Descriptors (all const, placed in flash) ────────────────── */
static const uint8_t dev_descr[] = {
    0x12, 0x01, 0x00, 0x02, 0xEF, 0x02, 0x01, EP0_SIZE,
    0x86, 0x1A,  /* VID: 0x1A86 */
    0x0D, 0xFE,  /* PID: 0xFE0D (keyboard + CDC) */
    0x01, 0x00,  /* bcdDevice 0.01 */
    0x01, 0x02, 0x03, 0x01
};

static const uint8_t cfg_descr[] = {
    /* Configuration descriptor */
    0x09, 0x02, 0x64, 0x00, 0x03, 0x01, 0x00, 0x80, 0x32,
    /* IAD: group interfaces 0 and 1 as CDC */
    0x08, 0x0B, 0x00, 0x02, 0x02, 0x02, 0x01, 0x00,
    /* Interface 0: CDC (comm) */
    0x09, 0x04, 0x00, 0x00, 0x01, 0x02, 0x02, 0x01, 0x00,
    /* CDC Header */
    0x05, 0x24, 0x00, 0x10, 0x01,
    /* CDC Call Management */
    0x05, 0x24, 0x01, 0x00, 0x01,
    /* CDC ACM */
    0x04, 0x24, 0x02, 0x02,
    /* CDC Union */
    0x05, 0x24, 0x06, 0x00, 0x01,
    /* EP1 IN: interrupt, 8 bytes, 255ms */
    0x07, 0x05, 0x81, 0x03, 0x08, 0x00, 0xFF,
    /* Interface 1: CDC Data */
    0x09, 0x04, 0x01, 0x00, 0x02, 0x0A, 0x00, 0x00, 0x00,
    /* EP2 OUT: bulk, 64 bytes */
    0x07, 0x05, 0x02, 0x02, EP_SIZE, 0x00, 0x00,
    /* EP3 IN: bulk, 64 bytes */
    0x07, 0x05, 0x83, 0x02, EP_SIZE, 0x00, 0x00,
    /* Interface 2: HID boot keyboard */
    0x09, 0x04, 0x02, 0x00, 0x01, 0x03, 0x01, 0x01, 0x00,
    0x09, 0x21, 0x11, 0x01, 0x00, 0x01, 0x22,
    sizeof(hid_report_descr), 0x00,
    /* EP5 IN: interrupt, 8 bytes, 10ms */
    0x07, 0x05, 0x85, 0x03, 0x08, 0x00, 0x0A,
};

static const uint8_t lang_descr[] = { 0x04, 0x03, 0x09, 0x04 };

static const uint8_t manu_descr[] = {
    0x12, 0x03,
    'C',0, 'H',0, '3',0, '2',0, 'X',0, '0',0, '3',0, '5',0
};

static const uint8_t prod_descr[] = {
    0x16, 0x03,
    'U',0, 'S',0, 'B',0, ' ',0, 'K',0, 'e',0, 'y',0, 'p',0, 'a',0, 'd',0
};

/* Serial number: filled at runtime from chip UID (96-bit = 24 hex chars) */
static uint8_t serial_descr[50] = {
    0x32, 0x03,
    '0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,
    '0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,
    '0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0
};

/* ── CDC line coding ─────────────────────────────────────────── */
static uint8_t cdc_line_coding[7] = {
    0x00, 0xC2, 0x01, 0x00,  /* 115200 bps LE */
    0x00, 0x00, 0x08          /* 1 stop, no parity, 8 data */
};

/* ── USB state ───────────────────────────────────────────────── */
static const uint8_t *pDescr;
static volatile uint8_t  setupReqCode;
static volatile uint8_t  setupReqType;
static volatile uint16_t setupReqLen;
static volatile uint16_t setupReqValue;
static volatile uint16_t setupReqIndex;
static volatile uint8_t  devConfig;
static volatile uint8_t  devAddr;

/* ── Reboot state (polled from main loop) ────────────────────── */
static volatile uint8_t  reboot_pending;
static volatile uint8_t  magic_baud_armed;

/* ── Endpoint buffers (4-byte aligned for DMA) ───────────────── */
__attribute__((aligned(4))) static uint8_t ep0_buf[EP0_SIZE];
__attribute__((aligned(4))) static uint8_t ep2_rx_buf[EP_SIZE];
__attribute__((aligned(4))) static uint8_t ep3_tx_dma[EP_SIZE];

#define pSetupReq  ((USB_SETUP_REQ *)ep0_buf)

/* ── RX ring buffer (256B, 8-bit wrap = no modulo) ───────────── */
static volatile uint8_t rx_ring[256];
static volatile uint8_t rx_head, rx_tail;

/* ── TX state ────────────────────────────────────────────────── */
static volatile uint8_t tx_busy;
static volatile uint8_t hid_busy;
static volatile uint8_t hid_protocol = 1;
static volatile uint8_t hid_idle;
__attribute__((aligned(4))) static uint8_t hid_tx_dma[8];

/* ── Config ──────────────────────────────────────────────────── */
static int magic_baud_enable = 1;
static uint32_t magic_baud = 1200;
static void (*pre_reboot_hook)(void);

