esehehelp/key/hardware/key/ch32x035f7p6/cores/arduino/ch32x_cdc.c
/* ── Weak RX callback ────────────────────────────────────────── */
__attribute__((weak))
void ch32x_cdc_on_rx(const uint8_t *buf, size_t len) {
    (void)buf; (void)len;
}

/* ── Build serial number from chip UID ───────────────────────── */
static void build_serial(void) {
    static const char hex[] = "0123456789ABCDEF";
    const uint8_t *uid = (const uint8_t *)ESIG_UID_BASE;
    for (int i = 0; i < 12; i++) {
        serial_descr[2 + i*4 + 0] = hex[(uid[i] >> 4) & 0xF];
        serial_descr[2 + i*4 + 1] = 0;
        serial_descr[2 + i*4 + 2] = hex[uid[i] & 0xF];
        serial_descr[2 + i*4 + 3] = 0;
    }
}

/* ── Endpoint init ───────────────────────────────────────────── */
static void endp_init(void) {
    USBFSD->UEP4_1_MOD = USBFS_UEP1_TX_EN;
    USBFSD->UEP2_3_MOD = USBFS_UEP2_RX_EN | USBFS_UEP3_TX_EN;
    USBFSD->UEP567_MOD = HID_EP5_TX_EN;
    HID_DMA = (uint32_t)hid_tx_dma;

    USBFSD->UEP0_DMA = (uint32_t)ep0_buf;
    USBFSD->UEP2_DMA = (uint32_t)ep2_rx_buf;
    USBFSD->UEP3_DMA = (uint32_t)ep3_tx_dma;

    USBFSD->UEP0_CTRL_H = USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;
    USBFSD->UEP1_CTRL_H = USBFS_UEP_T_RES_NAK;
    USBFSD->UEP2_CTRL_H = USBFS_UEP_R_RES_ACK;
    USBFSD->UEP3_CTRL_H = USBFS_UEP_T_RES_NAK;
    HID_CTRL = USBFS_UEP_T_RES_NAK;
    HID_TX_LEN = 0;
    hid_busy = 0;
    USBFSD->UEP1_TX_LEN = 0;
    USBFSD->UEP3_TX_LEN = 0;
}

/* ── USB-C sink CC setup ─────────────────────────────────────── */
static void cc_sink_init(void) {
    RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOC;
    RCC->AHBPCENR  |= RCC_AHBPeriph_USBPD;

    /* PC14, PC15 = floating input: CNF=01 MODE=00 = 0x4 each */
    GPIOC->CFGHR = (GPIOC->CFGHR & ~(0xFFu << 24)) | (0x44u << 24);

    AFIO->CTLR |= AFIO_CTLR_USBPD_IN_HVT | AFIO_CTLR_USBPD_PHY_V33;
    USBPD->CONFIG = 0;
    USBPD->CONTROL = 0;

    /* The board has discrete 5.1k Rd resistors on both CC pins.
     * On CH32X035, CC_PD is used as the USBPD sink role marker; it is not
     * a substitute for the external Rd termination. */
    USBPD->PORT_CC1 = CC_CMP_66 | CC_PD;
    USBPD->PORT_CC2 = CC_CMP_66 | CC_PD;
}

/* ══════════════════════════════════════════════════════════════
 *  Reboot to BootROM
 * ══════════════════════════════════════════════════════════════ */
void ch32x_cdc_reboot_to_bootrom(void) {
    __disable_irq();
    if (pre_reboot_hook) pre_reboot_hook();
    USBFSD->BASE_CTRL &= ~USBFS_UC_DEV_PU_EN;
    for (volatile int i = 0; i < 800000; i++) __asm volatile("");
    RCC->RSTSCKR |= RCC_RSTSCKR_RMVF;
    FLASH->BOOT_MODEKEYR = FLASH_KEY1;
    FLASH->BOOT_MODEKEYR = FLASH_KEY2;
    FLASH->STATR |= FLASH_STATR_BOOT_MODE;
    PFIC->CFGR = PFIC_KEY3 | PFIC_SYSRST;
    for (;;) __asm volatile("nop");
}

/* ══════════════════════════════════════════════════════════════
 *  USBFS IRQ Handler
 * ══════════════════════════════════════════════════════════════ */
void USBFS_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));

void USBFS_IRQHandler(void) {
    uint8_t intflag = USBFSD->INT_FG;
    uint8_t intst   = USBFSD->INT_ST;

    if (intflag & USBFS_UIF_TRANSFER) {
        uint8_t token = intst & USBFS_UIS_TOKEN_MASK;
        uint8_t ep    = intst & USBFS_UIS_ENDP_MASK;

        switch (token) {

        /* ──── SETUP ──────────────────────────────────────────── */
        case USBFS_UIS_TOKEN_SETUP: {
            USBFSD->UEP0_CTRL_H = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_NAK
                                 | USBFS_UEP_R_TOG | USBFS_UEP_R_RES_NAK;

            setupReqType  = pSetupReq->bRequestType;
            setupReqCode  = pSetupReq->bRequest;
            setupReqLen   = pSetupReq->wLength;
            setupReqValue = pSetupReq->wValue;
            setupReqIndex = pSetupReq->wIndex;

            uint16_t len = 0;
            uint8_t  err = 0;

            if ((setupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS &&
                setupReqIndex == 2) {
                switch (setupReqCode) {
                case 0x01: /* GET_REPORT */
                    pDescr = empty_report; len = 8; break;
                case 0x02: ep0_buf[0] = hid_idle; setupReqLen = 1; break; /* GET_IDLE */
                case 0x03: ep0_buf[0] = hid_protocol; setupReqLen = 1; break;
                case 0x09: break; /* SET_REPORT: output LEDs */
                case 0x0A: hid_idle = (uint8_t)(setupReqValue >> 8); break;
                case 0x0B: hid_protocol = (uint8_t)setupReqValue; break;
                default: err = 1; break;
                }
            }
            else if ((setupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS &&
                     setupReqIndex == 0) {
                switch (setupReqCode) {
                case CDC_GET_LINE_CODING:
                    pDescr = cdc_line_coding; len = 7; break;
                case CDC_SET_LINE_CODING:
                case CDC_SEND_BREAK:
                    break;
                case CDC_SET_LINE_CTLSTE:
                    /* A touch is a 1200-bps open followed by DTR release.
                     * Selecting 1200 in Serial Monitor alone must not reboot. */
                    if (magic_baud_armed && !(setupReqValue & 0x0001u)) {
                        reboot_pending = 1;
                        magic_baud_armed = 0;
                    }
                    break;
                default: err = 1; break;
                }
                if (!err && len) {
                    if (setupReqLen > len) setupReqLen = len;
                    len = (setupReqLen >= EP0_SIZE) ? EP0_SIZE : setupReqLen;
                    memcpy(ep0_buf, pDescr, len);
                    pDescr += len;
                }
            }
            else if ((setupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD) {
                switch (setupReqCode) {

                case USB_GET_DESCRIPTOR:
                    switch ((uint8_t)(setupReqValue >> 8)) {
                    case USB_DESCR_TYP_DEVICE:
                        pDescr = dev_descr;  len = sizeof(dev_descr);  break;
                    case USB_DESCR_TYP_CONFIG:
                        pDescr = cfg_descr;  len = sizeof(cfg_descr);  break;
                    case USB_DESCR_TYP_STRING:
                        switch ((uint8_t)(setupReqValue & 0xFF)) {
                        case 0: pDescr = lang_descr;   len = sizeof(lang_descr);   break;
                        case 1: pDescr = manu_descr;   len = sizeof(manu_descr);   break;
                        case 2: pDescr = prod_descr;   len = sizeof(prod_descr);   break;
                        case 3: pDescr = serial_descr;  len = sizeof(serial_descr); break;
                        default: err = 1; break;
                        }
                        break;
                    case 0x21: /* HID descriptor, interface 2 only */
                        if (setupReqIndex != 2) { err = 1; break; }
                        pDescr = hid_descr; len = sizeof(hid_descr); break;
                    case 0x22: /* HID report descriptor */
                        if (setupReqIndex != 2) { err = 1; break; }
                        pDescr = hid_report_descr; len = sizeof(hid_report_descr); break;
                    default: err = 1; break;
                    }
                    if (!err) {
                        if (setupReqLen > len) setupReqLen = len;
                        len = (setupReqLen >= EP0_SIZE) ? EP0_SIZE : setupReqLen;
                        memcpy(ep0_buf, pDescr, len);
                        pDescr += len;
                    }
                    break;

                case USB_SET_ADDRESS:
                    devAddr = (uint8_t)setupReqValue;
                    break;

