esehehelp/key/hardware/key/ch32x035f7p6/cores/arduino/ch32x_cdc.c
                case USB_GET_CONFIGURATION:
                    ep0_buf[0] = devConfig;
                    if (setupReqLen > 1) setupReqLen = 1;
                    break;

                case USB_SET_CONFIGURATION:
                    if (setupReqValue > 1) { err = 1; break; }
                    devConfig = (uint8_t)setupReqValue;
                    hid_busy = 0;
                    HID_CTRL = USBFS_UEP_T_RES_NAK;
                    HID_TX_LEN = 0;
                    break;

                case USB_CLEAR_FEATURE:
                    if ((setupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) {
                        switch ((uint8_t)setupReqIndex) {
                        case (UEP_IN|1):  USBFSD->UEP1_CTRL_H = USBFS_UEP_T_RES_NAK; break;
                        case (UEP_OUT|2): USBFSD->UEP2_CTRL_H = USBFS_UEP_R_RES_ACK; break;
                        case (UEP_IN|3):  USBFSD->UEP3_CTRL_H = USBFS_UEP_T_RES_NAK; break;
                        case (UEP_IN|5):  HID_CTRL = USBFS_UEP_T_RES_NAK; break;
                        default: err = 1; break;
                        }
                    } else {
                        err = (setupReqType & USB_REQ_RECIP_MASK) != USB_REQ_RECIP_DEVICE;
                    }
                    break;

                case USB_SET_FEATURE:
                    if ((setupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP &&
                        (uint8_t)setupReqValue == USB_REQ_FEAT_ENDP_HALT) {
                        switch ((uint8_t)setupReqIndex) {
                        case (UEP_IN|1):
                            USBFSD->UEP1_CTRL_H = (USBFSD->UEP1_CTRL_H & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_STALL; break;
                        case (UEP_OUT|2):
                            USBFSD->UEP2_CTRL_H = (USBFSD->UEP2_CTRL_H & ~USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_RES_STALL; break;
                        case (UEP_IN|3):
                            USBFSD->UEP3_CTRL_H = (USBFSD->UEP3_CTRL_H & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_STALL; break;
                        case (UEP_IN|5):
                            HID_CTRL = (HID_CTRL & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_STALL; break;
                        default: err = 1; break;
                        }
                    } else { err = 1; }
                    break;

                case USB_GET_STATUS:
                    ep0_buf[0] = 0; ep0_buf[1] = 0;
                    if ((setupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) {
                        switch ((uint8_t)setupReqIndex) {
                        case (UEP_IN|1):
                            if ((USBFSD->UEP1_CTRL_H & USBFS_UEP_T_RES_MASK) == USBFS_UEP_T_RES_STALL) ep0_buf[0] = 1;
                            break;
                        case (UEP_OUT|2):
                            if ((USBFSD->UEP2_CTRL_H & USBFS_UEP_R_RES_MASK) == USBFS_UEP_R_RES_STALL) ep0_buf[0] = 1;
                            break;
                        case (UEP_IN|3):
                            if ((USBFSD->UEP3_CTRL_H & USBFS_UEP_T_RES_MASK) == USBFS_UEP_T_RES_STALL) ep0_buf[0] = 1;
                            break;
                        case (UEP_IN|5):
                            if ((HID_CTRL & USBFS_UEP_T_RES_MASK) == USBFS_UEP_T_RES_STALL) ep0_buf[0] = 1;
                            break;
                        default: err = 1; break;
                        }
                    }
                    if (setupReqLen > 2) setupReqLen = 2;
                    break;

                case USB_GET_INTERFACE:
                    ep0_buf[0] = 0;
                    if (setupReqLen > 1) setupReqLen = 1;
                    break;

                case USB_SET_INTERFACE:
                    break;

                default: err = 1; break;
                }
            }
            else { err = 1; }

            /* Handshake */
            if (err) {
                USBFSD->UEP0_CTRL_H = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_STALL
                                     | USBFS_UEP_R_TOG | USBFS_UEP_R_RES_STALL;
            } else if (setupReqType & 0x80) {  /* IN */
                len = (setupReqLen > EP0_SIZE) ? EP0_SIZE : setupReqLen;
                setupReqLen -= len;
                USBFSD->UEP0_TX_LEN = len;
                USBFSD->UEP0_CTRL_H = (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK)
                                     | USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
            } else {                           /* OUT */
                if (setupReqLen == 0) {
                    USBFSD->UEP0_TX_LEN = 0;
                    USBFSD->UEP0_CTRL_H = (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK)
                                         | USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
                } else {
                    USBFSD->UEP0_CTRL_H = (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_R_RES_MASK)
                                         | USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
                }
            }
            break;
        }

        /* ──── IN ─────────────────────────────────────────────── */
        case USBFS_UIS_TOKEN_IN:
            if (ep == 5) {
                HID_CTRL ^= USBFS_UEP_T_TOG;
                HID_CTRL = (HID_CTRL & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_NAK;
                hid_busy = 0;
            } else if (ep == 3) {
                USBFSD->UEP3_CTRL_H ^= USBFS_UEP_T_TOG;
                USBFSD->UEP3_CTRL_H = (USBFSD->UEP3_CTRL_H & ~USBFS_UEP_T_RES_MASK)
                                     | USBFS_UEP_T_RES_NAK;
                tx_busy = 0;
            } else if (ep == 0) {
                if (setupReqLen == 0)
                    USBFSD->UEP0_CTRL_H = (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_R_RES_MASK)
                                         | USBFS_UEP_R_TOG | USBFS_UEP_R_RES_ACK;
                if ((setupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD) {
                    if (setupReqCode == USB_GET_DESCRIPTOR) {
                        uint16_t l = (setupReqLen >= EP0_SIZE) ? EP0_SIZE : setupReqLen;
                        memcpy(ep0_buf, pDescr, l);
                        setupReqLen -= l;
                        pDescr += l;
                        USBFSD->UEP0_TX_LEN  = l;
                        USBFSD->UEP0_CTRL_H ^= USBFS_UEP_T_TOG;
                    } else if (setupReqCode == USB_SET_ADDRESS) {
                        USBFSD->DEV_ADDR = (USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT) | devAddr;
                    }
                }
            }
            break;

        /* ──── OUT ────────────────────────────────────────────── */
        case USBFS_UIS_TOKEN_OUT:
            if (ep == 0) {
                if (intst & USBFS_UIS_TOG_OK) {
                    if ((setupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS) {
                        if (setupReqIndex == 2) {
                            /* HID SET_REPORT: accept LED output byte, no LEDs wired. */
                            setupReqLen = 0;
                        } else if (setupReqIndex == 0) {
                        if (setupReqCode == CDC_SET_LINE_CODING) {
                            memcpy(cdc_line_coding, ep0_buf, 7);
                            if (magic_baud_enable) {
                                uint32_t baud = (uint32_t)cdc_line_coding[0]
                                              | ((uint32_t)cdc_line_coding[1] << 8)
                                              | ((uint32_t)cdc_line_coding[2] << 16)
                                              | ((uint32_t)cdc_line_coding[3] << 24);
                                magic_baud_armed = (baud == magic_baud);
                            }
                        }
                        setupReqLen = 0;
                        }
                    }
                    if (setupReqLen == 0) {
                        USBFSD->UEP0_TX_LEN = 0;
                        USBFSD->UEP0_CTRL_H = (USBFSD->UEP0_CTRL_H & ~USBFS_UEP_T_RES_MASK)
                                             | USBFS_UEP_T_TOG | USBFS_UEP_T_RES_ACK;
                    }
                }
            } else if (ep == 2) {
                if (intst & USBFS_UIS_TOG_OK) {
                    USBFSD->UEP2_CTRL_H ^= USBFS_UEP_R_TOG;
                    uint16_t rxlen = USBFSD->RX_LEN;
                    for (uint16_t i = 0; i < rxlen; i++) {
                        uint8_t next = (uint8_t)(rx_head + 1);
                        if (next != rx_tail) {
                            rx_ring[rx_head] = ep2_rx_buf[i];
                            rx_head = next;
                        }
                    }
                    if (rxlen > 0)
                        ch32x_cdc_on_rx(ep2_rx_buf, rxlen);
                }
                USBFSD->UEP2_CTRL_H = (USBFSD->UEP2_CTRL_H & ~USBFS_UEP_R_RES_MASK)
                                     | USBFS_UEP_R_RES_ACK;
            }
            break;

