esehehelp/key/hardware/key/ch32x035f7p6/cores/arduino/ch32x_cdc.c
        default: break;
        }
        USBFSD->INT_FG = USBFS_UIF_TRANSFER;
    }
    else if (intflag & USBFS_UIF_BUS_RST) {
        devConfig = 0;
        devAddr   = 0;
        hid_protocol = 1;
        hid_idle = 0;
        USBFSD->DEV_ADDR = 0;
        endp_init();
        reboot_pending = 0;
        magic_baud_armed = 0;
        cdc_line_coding[0] = 0x00; cdc_line_coding[1] = 0xC2;
        cdc_line_coding[2] = 0x01; cdc_line_coding[3] = 0x00;
        cdc_line_coding[4] = 0x00; cdc_line_coding[5] = 0x00;
        cdc_line_coding[6] = 0x08;
        USBFSD->INT_FG = USBFS_UIF_BUS_RST;
    }
    else if (intflag & USBFS_UIF_SUSPEND) {
        USBFSD->INT_FG = USBFS_UIF_SUSPEND;
    }
    else {
        USBFSD->INT_FG = intflag;
    }
}

/* ══════════════════════════════════════════════════════════════
 *  Public API
 * ══════════════════════════════════════════════════════════════ */

void ch32x_cdc_init(const ch32x_cdc_config_t *cfg) {
    if (cfg) {
        if (cfg->magic_baud)
            magic_baud = cfg->magic_baud;
        magic_baud_enable = cfg->magic_baud_enable;
        pre_reboot_hook = cfg->pre_reboot;
    }

    /* System clock: HSI on, 2 wait-states, HCLK = SYSCLK (no AHB prescaler) */
    RCC->CTLR |= 1;
    FLASH->ACTLR = (FLASH->ACTLR & ~0x03) | 0x02;  /* 2 wait-states before speed-up */
    RCC->CFGR0 = (RCC->CFGR0 & ~(0xFu << 4));      /* HPRE[7:4] = 0 → div1, 48 MHz */

    build_serial();

    /* Enable clocks */
    RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOC;
    RCC->AHBPCENR  |= RCC_AHBPeriph_USBFS;

    /* Present sink termination before asserting the USB D+ pull-up. */
    cc_sink_init();

    /* USB GPIO: PC16=DM floating, PC17=DP pull-up */
    GPIOC->CFGXR = (GPIOC->CFGXR & ~0xFFu) | 0x84u;
    GPIOC->BSHR  = (1 << 17);

    /* AFIO: 3.3V, 1.5k pull-up on D+, USB I/O enable */
    AFIO->CTLR = (AFIO->CTLR & ~(AFIO_CTLR_UDP_PUE | AFIO_CTLR_UDM_PUE))
               | AFIO_CTLR_USB_PHY_V33 | AFIO_CTLR_UDP_PUE_1K5 | AFIO_CTLR_USB_IOEN;

    /* USB controller init */
    USBFSD->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    for (volatile int i = 0; i < 500; i++) __asm volatile("");  /* ~10us at 48MHz */
    USBFSD->BASE_CTRL = 0;
    endp_init();
    USBFSD->DEV_ADDR  = 0;
    USBFSD->BASE_CTRL = USBFS_UC_DEV_PU_EN | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
    USBFSD->INT_FG    = 0xFF;
    USBFSD->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;
    USBFSD->INT_EN    = USBFS_UIE_SUSPEND | USBFS_UIE_BUS_RST | USBFS_UIE_TRANSFER;
    NVIC_EnableIRQ(USBFS_IRQn);
}

int ch32x_cdc_available(void) {
    return (uint8_t)(rx_head - rx_tail);
}

int ch32x_cdc_peek(void) {
    if (rx_head == rx_tail) return -1;
    return rx_ring[rx_tail];
}

int ch32x_cdc_read(void) {
    if (rx_head == rx_tail) return -1;
    uint8_t c = rx_ring[rx_tail];
    rx_tail = (uint8_t)(rx_tail + 1);
    return c;
}

size_t ch32x_cdc_read_buf(uint8_t *buf, size_t max) {
    size_t n = 0;
    while (n < max && rx_head != rx_tail) {
        buf[n++] = rx_ring[rx_tail];
        rx_tail = (uint8_t)(rx_tail + 1);
    }
    return n;
}

size_t ch32x_cdc_write(const uint8_t *buf, size_t len) {
    if (!devConfig) return 0;
    size_t total = 0;
    while (total < len) {
        uint32_t timeout = 1000000;
        while (tx_busy && --timeout) __asm volatile("");
        if (tx_busy) return total;
        size_t chunk = len - total;
        if (chunk > EP_SIZE) chunk = EP_SIZE;
        memcpy(ep3_tx_dma, buf + total, chunk);
        USBFSD->UEP3_TX_LEN = chunk;
        tx_busy = 1;
        USBFSD->UEP3_CTRL_H = (USBFSD->UEP3_CTRL_H & ~USBFS_UEP_T_RES_MASK)
                             | USBFS_UEP_T_RES_ACK;
        total += chunk;
    }
    return total;
}

void ch32x_cdc_flush(void) {
    uint32_t timeout = 1000000;
    while (tx_busy && --timeout) __asm volatile("");
}

size_t ch32x_cdc_print(const char *s) {
    size_t len = 0;
    while (s[len]) len++;
    return ch32x_cdc_write((const uint8_t *)s, len);
}

/* Non-blocking; caller retries the latest state when the USB host is busy. */
int ch32x_hid_send(const uint8_t report[8]) {
    if (!devConfig || hid_busy) return 0;
    memcpy(hid_tx_dma, report, 8);
    HID_TX_LEN = 8;
    hid_busy = 1;
    HID_CTRL = (HID_CTRL & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_ACK;
    return 1;
}

void ch32x_cdc_poll(void) {
    if (reboot_pending) {
        /* Wait ~80ms for host to process SET_LINE_CODING response */
        for (volatile int i = 0; i < 800000; i++) __asm volatile("");
        ch32x_cdc_reboot_to_bootrom();
    }
}
